# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!
  
#### Import all the necessary libraries here:

In [1]:
# Libraries
import pandas as pd
import numpy as np

# Challenge 1

#### Read the `employees` dataset from Ironhack's database:
* db: `employees`
* table: `employees`

Save your data in a variable called `employees`.

In [13]:
# your code here
employees = pd.read_csv('employees.csv')
employees

    Department Education      Title      Name  Years  Salary
0        Admin    Master  associate     David      4      58
1           IT    Master  associate    Thomas      7      45
2        Admin    Master  associate     Diana     10      52
3        Admin    Master         VP  Manuella     15      33
4        Sales    Master    Analyst     Carla      6      38
..         ...       ...        ...       ...    ...     ...
495      Sales       PhD         VP    Calvin      2     119
496         HR    Master    Analyst    Dustin      6      67
497      Sales       PhD         VP   Winston     13      93
498         IT       PhD    Analyst      Earl     12     108
499      Sales    Master    Analyst     Alvin     13      48

[500 rows x 6 columns]

#### What's the mean `Salary` by `Department`?
**Tip**: There are 2 ways to do it: with or without pivot tables. Do it both ways.

In [7]:
# Method 1
# your code here
employees.groupby('Department').agg('mean')

               Years     Salary
Department
Admin       7.642276  76.325203
HR          7.172131  74.237705
IT          8.141791  70.671642
Sales       7.206612  73.132231

In [9]:
# Method 2
# your code here
employees.pivot_table(index = ['Department'])

               Salary     Years
Department
Admin       76.325203  7.642276
HR          74.237705  7.172131
IT          70.671642  8.141791
Sales       73.132231  7.206612

#### Now, group the data by more than one column. Use Pandas pivot table function to select the mean `Salary` by `Department` and `Title`.

In [11]:
employees.pivot_table(index = ['Department', 'Title'])

                         Salary     Years
Department Title
Admin      Analyst    77.736842  7.684211
           VP         75.571429  8.142857
           associate  75.813953  7.116279
HR         Analyst    71.404762  7.761905
           VP         75.441176  5.823529
           associate  75.934783  7.630435
IT         Analyst    69.600000  7.688889
           VP         74.000000  8.702128
           associate  68.095238  8.000000
Sales      Analyst    76.074074  8.166667
           VP         66.675000  7.325000
           associate  76.814815  5.111111

#### Display the number of `Years` of work experience and the `Salary` for each `Title`. Add `Years` as a column in your pivot table.
**Hint**: Use Pandas documentation to explore the [pivot table](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.pivot_table.html) function.

In [12]:
# your code here
employees.pivot_table(index = ['Department', 'Title'], columns = ['Years'])

                         Salary                                            \
Years                        1     2           3           4           5
Department Title
Admin      Analyst    84.750000  52.0   62.000000   64.333333   66.750000
           VP         74.833333  86.0   68.600000   68.000000   88.000000
           associate  85.333333  97.5  100.500000   72.833333   60.000000
HR         Analyst          NaN  69.0   88.250000   77.166667  100.333333
           VP         88.600000  97.0   70.800000   77.250000   67.000000
           associate  70.200000  69.5   99.000000   96.000000   44.000000
IT         Analyst    64.000000  41.0   65.888889  101.750000   72.000000
           VP         58.000000  76.0   65.750000  117.000000  106.000000
           associate  75.000000  71.0   72.250000   62.000000   99.000000
Sales      Analyst    76.250000  66.8   83.666667   50.500000   74.250000
           VP         48.000000  83.0   69.750000         NaN   85.000000
           associate  79.000000  91.0   81.125000   69.000000   70.666667

                                                                     \
Years                        6           7           8           9
Department Title
Admin      Analyst    98.500000   83.000000         NaN   93.166667
           VP         50.000000  110.500000   46.000000  104.000000
           associate  36.000000   48.000000   64.500000   93.333333
HR         Analyst    70.333333   31.000000  115.000000   70.500000
           VP         65.250000   73.333333   80.000000   37.000000
           associate  83.857143   81.500000   76.000000  108.500000
IT         Analyst          NaN   68.333333   59.000000  100.000000
           VP         64.800000   76.000000   59.800000   63.250000
           associate  64.500000   70.000000  113.000000   56.666667
Sales      Analyst    94.750000         NaN   78.500000   75.500000
           VP         55.000000   70.800000   41.666667   46.500000
           associate  67.000000         NaN   33.000000         NaN

                                                                           \
Years                        10          11          12          13    14
Department Title
Admin      Analyst    69.000000  108.500000   72.000000   93.000000  73.5
           VP         86.000000   86.666667   91.333333   71.000000  57.8
           associate  62.166667  107.000000  107.000000   77.750000  64.0
HR         Analyst    58.500000   53.000000   61.200000   62.000000  69.0
           VP         74.500000   86.500000         NaN  101.000000  70.0
           associate  79.000000   68.250000   75.200000   66.500000  77.0
IT         Analyst    46.000000   58.000000   79.000000   62.333333  72.5
           VP         54.000000   86.250000   72.000000   79.500000  93.6
           associate  91.750000   46.000000   71.666667   36.500000  48.0
Sales      Analyst    80.400000   76.000000   69.200000   76.600000  48.0
           VP         63.000000   47.500000   62.000000  103.000000  75.0
           associate  67.000000  118.000000   79.000000   43.000000   NaN


Years                   15
Department Title
Admin      Analyst    44.0
           VP         69.5
           associate  75.5
HR         Analyst    55.0
           VP          NaN
           associate  55.5
IT         Analyst    78.0
           VP         64.5
           associate  63.5
Sales      Analyst    81.0
           VP         83.0
           associate   NaN

#### Find the mean `Salary` and number of employees in each `Department` and for each job `Title`.

In [26]:
# your code here
employees.pivot_table(index=['Department', 'Title'], values = ['Salary', 'Name'], aggfunc={'Salary':np.mean, 'Name':np.count_nonzero})

                      Name     Salary
Department Title
Admin      Analyst      38  77.736842
           VP           42  75.571429
           associate    43  75.813953
HR         Analyst      42  71.404762
           VP           34  75.441176
           associate    46  75.934783
IT         Analyst      45  69.600000
           VP           47  74.000000
           associate    42  68.095238
Sales      Analyst      54  76.074074
           VP           40  66.675000
           associate    27  76.814815

#### For each `Department` and each job `Title`, find the `Salary` median, minimum, maximum and standard deviation. Comment your results.

In [36]:
# your code here
employees.pivot_table(index=['Department'], values = ['Salary', 'Name'], aggfunc={'Salary':np.sum, 'Name':np.count_nonzero})

            Name  Salary
Department
Admin        123    9388
HR           122    9057
IT           134    9470
Sales        121    8849

In [ ]:
"""
your commments here
"""

#### Based on your comments, fill the missing values with an appropriate value.

In [ ]:
# your code here

#### The stake holders want to know, for each `Department`, the number of employees and how much money is spent on salaries. Could you provide that information?

In [34]:
# your code here
employees.pivot_table(index=['Department', 'Title'], values = ['Salary'], aggfunc = [np.sum])

                        sum
                     Salary
Department Title
Admin      Analyst     2954
           VP          3174
           associate   3260
HR         Analyst     2999
           VP          2565
           associate   3493
IT         Analyst     3132
           VP          3478
           associate   2860
Sales      Analyst     4108
           VP          2667
           associate   2074

#### For each `Department` and `Title`, find the the total years of work experience and the mean `Salary`.

In [41]:
# your code here
# your code here
employees.pivot_table(index=['Department', 'Title'], values = ['Salary', 'Years'], aggfunc={'Salary':np.mean, 'Years':np.sum})

                         Salary  Years
Department Title
Admin      Analyst    77.736842    292
           VP         75.571429    342
           associate  75.813953    306
HR         Analyst    71.404762    326
           VP         75.441176    198
           associate  75.934783    351
IT         Analyst    69.600000    346
           VP         74.000000    409
           associate  68.095238    336
Sales      Analyst    76.074074    441
           VP         66.675000    293
           associate  76.814815    138

## Bonus Challenge 1

#### Compute the mean `Salary` after removing the maximum `Salary` for each `Department`. Create the appropriate pivot table.
**Hint**: Write a custom function.

In [ ]:
# your code here
def delete_max():
    if salary == max salary then drop 
    #employees.drop(employees['Salary'].idxmax())

# Challenge 2

#### Read the `fitbit` dataset from Ironhack's database:
* db: `fitbit`
* table: `fitbit`

Save your data in a variable called `fitbit`.

In [ ]:
# your code here

#### Explore you dataset in terms of data types and descriptive statistics.
**Hint**: Use Pandas functions from previous lectures.

In [ ]:
# your code here

#### You suspect that there must be a linear relationship between the `Minutes Very Active` and the `Steps`. Compute the correlation between these variables.

In [ ]:
# your code here

#### Use matplotlib to visually plot `Minutes Very active` vs `Steps`. We'll work with matplotlib next week. As a first introduction, uncomment and complete the following code. You need to replace the # symbol for the correct function arguments.

In [ ]:
import matplotlib.pyplot as plt;

In [ ]:
"""
plt.scatter(#, #)
plt.title(#)
plt.xlabel(#)
plt.ylabel(#)
plt.show()
"""

#### What can you say about `Minutes Very Active` and `Steps`? Write a comment below.

In [ ]:
"""
your commments here
"""

#### We also suspect that there must be a linear relationship between the `Minutes Sedentary` and the `Steps`. Compute the correlation between these variables.

In [ ]:
# your code here

#### Use matplotlib to visually plot `Minutes Sedentary` vs `Steps`. Based on the results of the computed correlation and the plot, what can you say about these 2 variables?

In [ ]:
# your code here

In [ ]:
"""
your commments here
"""

#### We also suspect that there must be a linear relationship between the `MinutesOfSleep` and the `Steps`. Compute the correlation between these variables.

In [ ]:
# your code here

#### Use matplotlib to visually plot `MinutesOfSleep` vs `Steps`. Based on the results of the computed correlation and the plot, what can you say about these 2 variables?

In [ ]:
# your code here

In [ ]:
"""
your commments here
"""

#### Select a subset of your dataset with the columns below and compute the correlation matrix. Save the results in the variable `cor_fit`.

In [ ]:
columns = ['Calorie burned', 'Steps', 'Floors', 'Minutes Sedentary', 'Minutes Very Active', 'MinutesOfSleep']

In [ ]:
# your code here

#### Based on the result of the correlation matrix, which of the features are highly correlated with variable `Steps`?
**Hint**: sort the correlations of `Steps` vs the rest of the features in descending order. You can use Pandas `sort_values`.

In [ ]:
# your code here

# Challenge 3

#### Read the `time_grades` dataset from Ironhack's database:
* db: `time_grades`
* table: `time_grades`

Save your data in a variable called `time_grades`.

In [ ]:
# your code here

#### Show visually the frequency distribution of the `time_grades` dataset.

In [ ]:
# your code here

#### Is there a correlation between `Study time` and `Grade`? Use both Pearson and Spearman correlations and comment your results.

In [ ]:
# your code here

In [ ]:
"""
your commments here
"""

#### Use matplotlib to visually plot `Study time` vs `Grade`. Based on the results of the computed correlation and the plot, what can you say about these 2 variables?

In [ ]:
# your code here

In [ ]:
"""
your commments here
"""

#### Could you explain the difference between Pearson and Spearman correlations?

In [ ]:
"""
your commments here
"""